app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    render json: Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Post.find(params[:id])